import lamp1 from "../assets/img/Lamp_1.jpg";
import lamp2 from "../assets/img/Lamp_2.webp";


const products = [
  {
    id: 1,
    title: "RGB lamp 1",
    description:
      "Світлодіодна лампа з Wi-Fi керуванням, підтримкою RGB та димуванням.",
    price: 1200,
    image: lamp1,
    features: {
      overview:
        "Ця розумна лампа дозволяє керувати освітленням через мобільний додаток, змінювати кольори та яскравість, а також налаштовувати розклад увімкнення/вимкнення.",
      specifications: {
        Потужність: "9 Вт",
        Цоколь: "E27",
        "Світловий потік": "900 Лм",
        "Кут світіння": "270°",
        "Колірна температура": "4000K + RGB",
        "Термін служби": "30 000 годин",
        Керування: "Wi-Fi через додаток Smart Life",
        "Додаткові функції": "Музичний режим, таймер, 16 млн кольорів",
      },
      packageContents: ["Розумна лампа A1", "Інструкція користувача"],
    },
  },
  {
     id: 2,
     title: "RGB lamp 2",
     description:
       "Багатофункціональна лампа з підтримкою голосових помічників та широким діапазоном кольорів.",
     price: 800,
     image: lamp2,
     features: {
       overview:
         "Лампа B2 підтримує керування через Alexa та Google Assistant, має широкий діапазон кольорів та можливість налаштування сценаріїв освітлення.",
       specifications: {
         Потужність: "8,7 Вт",
         Цоколь: "E27",
         "Світловий потік": "806 Лм",
         "Кут світіння": "220°",
         "Колірна температура": "2500–6500K",
         "Термін служби": "15 000 годин",
         Керування: "Wi-Fi через додаток Tapo",
         "Додаткові функції": "Голосове керування, таймер, сценарії освітлення",
       },
       packageContents: ["Розумна лампа B2", "Керівництво користувача"],
     },
   },
   // Додайте інші лампи за аналогією
 ];

export default products;
